7zip
abseil-cpp
acl
ada
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
aom
appstream
aquamarine
archlinux-keyring
argon2
arpack
at-spi2-core
atkmm
attr
audit
autoconf
automake
avahi
awww
ayatana-ido
base
base-devel
bash
binutils
bison
blas
bluetui
bluez
bluez-libs
bluez-utils
boost-libs
brightnessctl
brotli
btop
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cblas
clucene
coreutils
cpio
cpptrace
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
dkms
dmidecode
double-conversion
duktape
dunst
e2fsprogs
efibootmgr
efivar
egl-gbm
egl-wayland
egl-wayland2
egl-x11
eglexternalplatform
elfutils
expat
fakeroot
fastfetch
fcft
fd
ffmpeg
fftw
file
filesystem
findutils
firefox
fish
flac
flex
fmt
fontconfig
freetype2
fribidi
fuse-common
fuse3
fuzzel
fzf
gawk
gc
gcc
gcc-libs
gdb
gdb-common
gdbm
gdk-pixbuf2
gettext
ghostscript
giflib
girara
git
gl2ps
glib-networking
glib2
glibc
glibmm
glpk
glslang
glu
glycin
gmp
gnu-free-fonts
gnulib-l10n
gnupg
gnutls
gobject-introspection
gobject-introspection-runtime
gperftools
gpgme
gpgmepp
gpm
gpsd
graphene
graphicsmagick
graphite
grep
grim
groff
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gssdp
gst-plugin-pipewire
gst-plugins-bad-libs
gst-plugins-base-libs
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtkmm3
guile
gumbo-parser
gupnp
gupnp-igd
gzip
harfbuzz
harfbuzz-icu
hdf5
hicolor-icon-theme
hidapi
highway
hunspell
hwdata
hwloc
hyphen
hyprcursor
hyprgraphics
hyprland
hyprland-guiutils
hyprlang
hyprtoolkit
hyprutils
hyprwayland-scanner
hyprwire
iana-etc
icu
ijs
imagemagick
iniparser
intel-ucode
iproute2
iptables
iputils
iso-codes
jansson
jbig2dec
jbigkit
jemalloc
jq
json-c
json-glib
jsoncpp
kbd
kconfig
kcoreaddons
kcrash
kdbusaddons
keyutils
ki18n
kirigami
kitty
kitty-shell-integration
kitty-terminfo
kmod
knotifications
krb5
kwindowsystem
l-smash
lame
lapack
lazygit
lcms2
leancrypto
leptonica
lib32-alsa-lib
lib32-alsa-plugins
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-glib2
lib32-glibc
lib32-gmp
lib32-gnutls
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libcurl-compat
lib32-libcurl-gnutls
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libngtcp2
lib32-libnm
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libunistring
lib32-libva
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxinerama
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nettle
lib32-nspr
lib32-nss
lib32-nvidia-utils
lib32-openssl
lib32-p11-kit
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libadwaita
libaec
libarchive
libasan
libass
libassuan
libasyncns
libatomic
libatomic_ops
libavc1394
libavif
libayatana-appindicator
libayatana-indicator
libb2
libbluray
libbpf
libbs2b
libbsd
libcanberra
libcap
libcap-ng
libcdr
libcloudproviders
libcmis
libcolord
libcups
libcurl-compat
libcurl-gnutls
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdvdnav
libdvdread
libdwarf
libe-book
libebur128
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexttextcat
libfabric
libfdk-aac
libffi
libfontenc
libfreeaptx
libfreehand
libfyaml
libgcc
libgcrypt
libgfortran
libgirepository
libglvnd
libgomp
libgpg-error
libgudev
libice
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libixion
libjpeg-turbo
libjxl
libksba
liblangtag
liblc3
libldac
libldap
liblqr
liblsan
libluv
libmakepkg-dropins
libmd
libmm-glib
libmnl
libmodplug
libmpc
libmpdclient
libmspub
libmupdf
libmwaw
libmysofa
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnsl
libnumbertext
libobjc
libodfgen
libogg
libopenmpt
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqalculate
libquadmath
libqxp
libraqm
libraw1394
libreoffice-fresh
libreoffice-fresh-es
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsm
libsndfile
libsodium
libsoup3
libsoxr
libssh
libssh2
libstaroffice
libstdc++
libstemmer
libsynctex
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtsan
libubsan
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libutf8proc
libuv
libva
libva-nvidia-driver
libvdpau
libverto
libvisio
libvorbis
libvpl
libvpx
libvterm
libwacom
libwebp
libwireplumber
libwpd
libwps
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyuv
libzip
libzmf
licenses
lilv
limine
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
llvm-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lua
lua51-lpeg
lua54
luajit
lv2
lz4
lzo
m4
mailcap
make
matugen
md4c
mesa
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpdecimal
mpfr
mpg123
msgpack-c
mtdev
muparser
nano
ncurses
neon
neovim
nettle
networkmanager
nftables
node-gyp
nodejs
nodejs-nopt
noto-fonts
npm
npth
nspr
nss
numactl
nvidia-open-dkms
nvidia-utils
ocl-icd
octave
oniguruma
opencore-amr
openjpeg2
openmpi
openpmix
openssl
openucx
opus
orc
p11-kit
pacman
pacman-mirrorlist
pahole
pam
pambase
pango
pangomm
patch
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
playerctl
polkit
polkit-kde-agent
polkit-qt6
poppler
poppler-data
popt
portaudio
pps-tools
procps-ng
prrte
psmisc
pugixml
python
python-autocommand
python-certifi
python-charset-normalizer
python-click
python-dbus
python-distro
python-gobject
python-idna
python-imageio
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-mako
python-markdown
python-markupsafe
python-more-itertools
python-numpy
python-packaging
python-pillow
python-pkg_resources
python-platformdirs
python-psutil
python-pyasyncore
python-pyinotify
python-pyxdg
python-requests
python-setuptools
python-typing_extensions
python-urllib3
python-urwid
python-wcwidth
python-wheel
qhull
qrupdate
qscintilla-qt6
qt5-base
qt5-declarative
qt5-translations
qt5-wayland
qt6-5compat
qt6-base
qt6-declarative
qt6-shadertools
qt6-svg
qt6-tools
qt6-translations
qt6-wayland
quickshell
raptor
rasqal
rav1e
re2
readline
redland
resvg
ripgrep
rtkit
rubberband
sbc
sdbus-cpp
sddm
sdl2-compat
sdl3
seatd
sed
semver
serd
shaderc
shadow
shared-mime-info
simdjson
slang
slurp
smartmontools
snap-pac
snapper
snappy
sndio
sof-firmware
sord
sound-theme-freedesktop
source-highlight
spandsp
spdlog
speex
speexdsp
spirv-tools
sqlite
sratom
srt
starship
steam
steam-devices
sudo
suitesparse
sundials
svt-av1
swappy
systemd
systemd-libs
systemd-sysvcompat
tar
tdb
tesseract
tesseract-data-osd
tesseract-data-spa
texinfo
tinysparql
tomlplusplus
tpm2-tss
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-common
tzdata
ufw
unibilium
upower
usbutils
util-linux
util-linux-libs
uwsm
v4l-utils
vapoursynth
vid.stab
vmaf
vulkan-icd-loader
waybar
wayland
wayland-protocols
webrtc-audio-processing-1
wget
which
wine
wiremix
wireplumber
wl-clipboard
wpa_supplicant
x264
x265
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-utils
xf86-input-libinput
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xinit
xorg-xkbcomp
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yazi
yyjson
zathura
zathura-pdf-mupdf
zenity
zeromq
zimg
zint
zix
zlib
zlib-ng
zoxide
zram-generator
zstd
zxing-cpp
